tutorials/cases/canonical/noSubintegration/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;

vertices
(
    (-8 -5 -5)
    ( 8 -5 -5)
    ( 8  5 -5)
    (-8  5 -5)
    (-8 -5  5)
    ( 8 -5  5)
    ( 8  5  5)
    (-8  5  5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (8 5 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 5 6 2)
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
