tutorials/cases/canonical/noSubintegration/constant/reactions
species
(
    targas N2
);

reactions
(
);
